<!DOCTYPE html>
<html lang="en" style="font-family: 'Courier New', Courier, monospace">
	<head>
		<meta charset="UTF-8">
		<meta http-equiv="X-UA-Compatible" content="IE=edge">
		<meta name="viewport" content="width=device-width, initial-scale=1.0">
		<link href="../style.css" type="text/css" rel="stylesheet" />
		<link rel="icon" href="../favicon.ico">
		<title>Проект 1. Калькулятор.</title>
	</head>

	<body>
		<form action="../index.html" style="display: flex;">
			<input type="submit" value="🡸" style="padding: auto; width: 32px; height: 32px;">
			<h1 style="margin: 0 2%;">Проект 1. Калькулятор.</h1>
		</form>
		<hr>
		
		<fieldset id="task-text">
<pre>
Требуется написать функцию-калькулятор, с поддержкой всех доступных арифметических операций.

Формат входных данных:
В первой строке идёт целое число N - количество примеров.
Затем идут N строк, каждая в формате "A op B", где A, B - числа, op - арифметический оператор.

Шаблон проекта:
</pre>
	<fieldset id="task-code" style="min-height: auto;">
<legend>Код:</legend>
<pre style="font-family: 'Courier New', Courier, monospace">
<b>def calculator(string):
	/* Новый код идёт сюда */
	return string

def main():
	n = int(input())
	for _ in range(n):
		task = input()
		print(calculator(task))

main()</b></pre>
	</fieldset>
</fieldset>

		<fieldset id="task-input">
			<legend>Входные данные:</legend>
<pre>
3
5 + 2
1 - 10
4 ** 2
</pre>

		</fieldset>

		<fieldset id="task-output">
			<legend>Выходные данные:</legend>
<pre>
7
-9
16
</pre>
		</fieldset>

		<hr>
		<fieldset>
			<legend><button id="task-hint-1" style="height: 24px;" onclick="hintLoad(this)">Подсказка #1</button></legend>
<pre hidden class="hint" id="task-hint-1-text">
Список арифметических операций: +, -, *, **, /, //, %.
</pre>
		</fieldset>
		<fieldset>
			<legend><button id="task-hint-2" style="height: 24px;" onclick="hintLoad(this)">Подсказка #2</button></legend>
<pre hidden class="hint" id="task-hint-2-text">
При делении на 0 следует вернуть "Деление на ноль".
</pre>
		</fieldset>
		<fieldset>
			<legend><button id="task-hint-3" style="height: 24px;" onclick="hintLoad(this)">ОТВЕТ</button></legend>
<pre hidden class="hint" id="task-hint-3-text" style="font-family: 'Courier New', Courier, monospace">
<b><a href='https://pastebin.com/4XLpviF5' target="blank">Решение на PasteBin</a></b>
</pre>
		</fieldset>
	</body>

	<script>
		function hintLoad(el) {
			document.getElementById(el.id + '-text').hidden = document.getElementById(el.id + '-text').hidden ? false : true;
		}
	</script>
</html>